In [44]:
import pandas as pd
df = pd.read_csv('practice_dataset.csv')

In [45]:
df.head()

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters,Activity_Code
0,2025-01-01,P0001,34.0,Female,Peshawar,34.3,High,4.556821,2.0
1,2025-01-02,P0002,49.0,Female,Peshawar,12.2,Medium,2.312542,1.0
2,2025-01-03,P0003,30.0,Female,Karachi,10.3,High,2.852035,2.0
3,2025-01-04,P0004,38.0,Male,Peshawar,44.2,Medium,4.463841,1.0
4,2025-01-05,P0005,39.0,Male,Islamabad,13.2,Medium,2.631068,1.0

In [46]:
df.tail(7)

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters,Activity_Code
2993,2025-03-15,P2994,NaN,Female,Quetta,15.2,Medium,2.792303,1.0
2994,2025-03-16,P2995,41.0,Male,Islamabad,38.0,High,4.218415,2.0
2995,2025-03-17,P2996,51.0,Male,Lahore,40.6,Low,3.387598,0.0
2996,2025-03-18,P2997,50.0,Female,Quetta,34.8,NaN,NaN,NaN
2997,2025-03-19,P2998,48.0,Male,Karachi,35.1,High,4.530414,2.0
2998,2025-03-20,P2999,48.0,Male,Islamabad,40.1,High,4.445685,2.0
2999,2025-03-21,P3000,60.0,Male,Lahore,22.7,High,3.761947,2.0

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   3000 non-null   object
 1   Person_ID              3000 non-null   object
 2   Age                    2824 non-null   float64
 3   Gender                 3000 non-null   object
 4   City                   3000 non-null   object
 5   Temperature_C          3000 non-null   float64
 6   Activity_Level         2904 non-null   object
 7   Water_Consumed_Liters  2904 non-null   float64
 8   Activity_Code          2904 non-null   float64
dtypes: float64(4), object(5)
memory usage: 211.1+ KB

In [48]:
df.isnull().sum()

Date                       0
Person_ID                  0
Age                      176
Gender                     0
City                       0
Temperature_C              0
Activity_Level            96
Water_Consumed_Liters     96
Activity_Code             96
dtype: int64

In [49]:
df['City'].value_counts()

City
Quetta       561
Lahore       545
Karachi      526
Islamabad    520
Peshawar     507
islamabad     80
peshawar      75
quetta        63
karachi       62
lahore        61
Name: count, dtype: int64

In [50]:
df.shape

(3000, 9)

In [51]:
df.columns

Index(['Date', 'Person_ID', 'Age', 'Gender', 'City', 'Temperature_C',
       'Activity_Level', 'Water_Consumed_Liters', 'Activity_Code'],
      dtype='object')

In [52]:
df.describe()

               Age  Temperature_C  Water_Consumed_Liters  Activity_Code
count  2824.000000    3000.000000            2904.000000    2904.000000
mean     39.298159      27.573767               3.388817       1.010331
std      12.350831      10.098816               0.662852       0.808943
min      18.000000      10.000000               1.634158       0.000000
25%      29.000000      18.700000               2.931803       0.000000
50%      39.000000      27.900000               3.379343       1.000000
75%      50.000000      36.400000               3.853508       2.000000
max      60.000000      45.000000               5.156914       2.000000

In [53]:
df.duplicated().sum()

0